Tekla.Structures.Model.LoadGroup
The LoadGroup class implements grouping functionality related to all loads.
Each load should be assigned to a load group. Each load group contains loads
caused by the same action and to which you want to refer collectively.
Tekla Structures assumes that all loads in a group
Have the same partial safety and other combination factors
Have the same action direction
Occur at the same time and all together
You may create new load groups, modify existing ones and delete
load groups via the .NET interface. You may also change the assigned load group
of a load and list all the load groups found in the model via the
ModelObjectSelector interface. The model always has at least one load group.
Creating a new load group:
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
LoadGroup WindLoads = new LoadGroup();
WindLoads.GroupName = "ExtremeNorthWind";
WindLoads.GroupType = LoadGroup.LoadGroupType.EUROCODE_WIND_LOAD;
WindLoads.Direction = LoadGroup.LoadGroupDirection.DIR_Y;
WindLoads.Compatible = 2;
WindLoads.Incompatible = 15;
WindLoads.Color = LoadGroup.Colors.RED;
WindLoads.Insert();
}
}
Selecting and browsing through all load groups:
using Tekla.Structures.Model;
using System;
public class Example
{
public void Example1()
{
Model Model = new Model();
ModelObjectEnumerator LoadGroups =
Model.GetModelObjectSelector().GetAllObjectsWithType(ModelObject.ModelObjectEnum.LOAD_GROUP);
foreach (LoadGroup group in LoadGroups)
{
Console.WriteLine("Group: " + group.GroupName + "(ID " + group.Identifier.ID + ")");
}
}
}

Tekla.Structures.Model.LoadGroup.GroupName
The load group name. The maximum size is 126 characters.

Tekla.Structures.Model.LoadGroup.GroupType
The load group type.

Tekla.Structures.Model.LoadGroup.Direction
The load group direction.

Tekla.Structures.Model.LoadGroup.Compatible
This variable is used to store information on which groups are compatible
with each other in structural analysis load combination.
Load combination is a process in which some simultaneously acting load groups
are multiplied by their partial safety factors and combined with each other
according to specific rules.
To accurately combine loads which have the same load group type,
you need to identify which load groups can occur at the same time,
i.e. are compatible.
This variable stores one integer, and all groups who have this same integer
are known to be compatible with each other. Depending on the analysis needs,
they may be calculated together, in smaller combinations, or separately.

Tekla.Structures.Model.LoadGroup.Incompatible
This variable is used to store information on which groups exclude each other
in structural analysis load combination.
Load combination is a process in which some simultaneously acting load groups
are multiplied by their partial safety factors and combined with each other
according to specific rules.
To accurately combine loads which have the same load group type,
you need to identify which load groups exclude each other,
i.e. are incompatible.
This variable stores one integer, and all groups who have this same integer
are known to be incompatible with each other.

Tekla.Structures.Model.LoadGroup.Color
The load group color. This variable indicates the color with which all
loads that belong to this same group are drawn in Tekla Structures views.

Tekla.Structures.Model.LoadGroup.#ctor
Creates a new load group instance.

Tekla.Structures.Model.LoadGroup.CheckVariables
Checks that all variables have a value.
Returns:

Tekla.Structures.Model.LoadGroup.Insert
Inserts the load group into the model database.
Returns: True on success.

Tekla.Structures.Model.LoadGroup.Select
Selects a load group from the model database. The ID must be set.
Returns: True on success.

Tekla.Structures.Model.LoadGroup.Modify
Modifies the existing load group in the model database to match the current one.
At the moment it is not possible to change the load attachment or the father.
Returns: True on success.

Tekla.Structures.Model.LoadGroup.Delete
Deletes the load group instance with the given ID from the model database.
Returns: True on success.